#include "fake_signal_emitter.h"

//************************************************************************************
// Функция потока, имитирующего сигнал СИ2
int SI2_emitter (void) {



}

//************************************************************************************
// Функция потока, имитирующего сигнал прерывания по шине ISA
int ISA_emitter (void) {

}

//************************************************************************************
// Функция вызова модуля - имитатора
// Создает 2 потока, из которых будут отправляться сигналы
unsigned char start_fake (pthread_t main_thread) {

}
